In [2]:
import pandas as pd
df=pd.read_csv("income.csv")
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [3]:
df["2010"]

0    40933
1    57848
2    46896
3    38587
4    54283
Name: 2010, dtype: int64

In [5]:
# to find sum of particular values in column
s=0
for i in df["2010"]:
    s=s+i
print(s)

238547

In [8]:
# to find the sum of row
df.iloc[1,2:]

2005    55891
2006    56418
2007    62993
2008    63989
2009    61604
2010    57848
2011    57431
2012    63648
2013    61137
Name: 1, dtype: object

In [9]:
s=0
for i in df.iloc[1,2:]:
    s=s+i
print(s)

540959

In [10]:
df["2010"].sum()

238547

In [11]:
# 4th row and all columns sum
df.iloc[4,2:]

2005    51755
2006    55319
2007    55734
2008    57014
2009    56134
2010    54283
2011    53367
2012    57020
2013    57528
Name: 4, dtype: object

In [12]:
s=0
for i in df.iloc[4,2:]:
    s=s+i
print(s)

498154

In [13]:
# another method for sum
df.iloc[4,2:].sum()

498154

In [14]:
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [16]:
a=df.iloc[0:,2:6].sum()
a

2005    226699
2006    233403
2007    264727
2008    251979
dtype: int64

In [18]:
a.sum()

976808

In [20]:
b=df.iloc[0:,2:].sum()
b.sum()

2199422

In [22]:
df.sum() # to find the total sum of individual columns

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

In [24]:
df.sum(1) # to find the total sum of the individual rows

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64